Revit 2024 API
DimensionEqualityLabelFormatting Members
The DimensionEqualityLabelFormatting type exposes the following members.
Constructors
Name | Description
DimensionEqualityLabelFormatting
 Constructs a new instance of a DimensionEqualityLabelFormatting object with specified settings.
Methods
Name | Description
Dispose
Releases all resources used by the DimensionEqualityLabelFormatting
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFormatOptions
 Gets the format options used to show the parameter value.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValidFormatOptions
 Checks whether a FormatOptions object is valid for the LabelType.
SetFormatOptions
 Sets the format options used to show the parameter value.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LabelType
 The parameter value to be shown.
LeadingSpaces
 The number of spaces to include before the parameter value.
Prefix
 The prefix to include before the parameter value.
Suffix
 The suffix to include after the parameter value.
See Also
DimensionEqualityLabelFormatting Class
Autodesk.Revit.DB Namespace